Revit 2027 API
RebarBendingDetail Methods
The RebarBendingDetail type exposes the following members.
Methods
Name | Description
AddHosts |  Adds the reinforcement elements that will be represented by the input bending detail.
Create |  Creates a new instance of a bending detail.
GetHost |  Gets a reference to the reinforcement element that this bending detail represents.
GetHosts |  Gets a reference to the reinforcement elements that this bending detail represents.
GetPosition |  Gets the position of the bending detail relative to its view.
GetRotation |  Gets the rotation angle in radians for the bending detail relative to its view.
GetTagRelativePosition |  Gets the embedded tag position w.r.t. the realistic bending detail element in model coordinates.
GetTagRelativeRotation |  Gets the embedded tag rotation angle w.r.t. the realistic bending detail element.
IsBendingDetail |  Checks if the input element is a bending detail.
IsRealisticBendingDetail |  Validate that the element is a realistic bending detail.
IsSchematicBendingDetail |  Validate that the element is a schematic bending detail.
RemoveHosts |  Remove the reinforcement elements from those represented by the input bending detail.
ResetAnnotationPositions |  Resets the positions of the bending detail annotations to the default position.
ResetTagRelativePosition |  Resets the embedded tag position w.r.t. the realistic bending detail element to the selected tag position.
SetHost |  Sets the reinforcement element that will be represented by the input bending detail.
SetPosition |  Sets the position for this bending detail relative to its view.
SetRotation |  Sets the rotation angle in radians for the bending detail relative to its view.
SetTagRelativePosition |  Sets the embedded tag position w.r.t. the realistic bending detail element in model coordinates.
SetTagRelativeRotation |  Sets the embedded tag rotation angle w.r.t. the realistic bending detail element.
Top
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace